#### One hot-encoding

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sb

In [2]:
df=pd.read_csv('titanic_train.csv')

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df['Sex_male']=pd.get_dummies(df['Sex'],drop_first=True)

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_male
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [6]:
df.drop(['Sex'],axis=1,inplace=True)

#### one hot-encoding with many categories in a feature

In [7]:
df_mer=pd.read_csv('mercedes.csv',usecols=['X0','X1','X2','X3','X4','X5','X6'])

In [8]:
df_mer.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [9]:
df_mer['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
aq     18
am     18
i      18
u      17
aw     16
l      16
ad     14
au     11
k      11
b      11
r      10
as     10
bc      6
ao      4
c       3
aa      2
q       2
ac      1
g       1
ab      1
Name: X0, dtype: int64

#### Ordinal Number Encoding

In [10]:
import datetime

In [11]:
today_date=datetime.datetime.today()

In [12]:
today_date

datetime.datetime(2023, 5, 23, 10, 48, 10, 544745)

In [13]:
today_date-datetime.timedelta(30)

datetime.datetime(2023, 4, 23, 10, 48, 10, 544745)

In [14]:
x=[today_date-datetime.timedelta(y) for y in range(1,16) ]

In [15]:
x

[datetime.datetime(2023, 5, 22, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 21, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 20, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 19, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 18, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 17, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 16, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 15, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 14, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 13, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 12, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 11, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 10, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 9, 10, 48, 10, 544745),
 datetime.datetime(2023, 5, 8, 10, 48, 10, 544745)]

In [16]:
data=pd.DataFrame(x)

In [17]:
data.columns=['Day']

In [18]:
data.head()

                         Day
0 2023-05-22 10:48:10.544745
1 2023-05-21 10:48:10.544745
2 2023-05-20 10:48:10.544745
3 2023-05-19 10:48:10.544745
4 2023-05-18 10:48:10.544745

In [19]:
data['weekday']=data['Day'].dt.day_name()

In [20]:
data.head()

                         Day   weekday
0 2023-05-22 10:48:10.544745    Monday
1 2023-05-21 10:48:10.544745    Sunday
2 2023-05-20 10:48:10.544745  Saturday
3 2023-05-19 10:48:10.544745    Friday
4 2023-05-18 10:48:10.544745  Thursday

In [21]:
['Monday','Tuesday']

['Monday', 'Tuesday']

In [22]:
rank={day:rank for (day,rank) in zip(['Sunday','Monday','Tuesday','Wednesday','Thursday','Friday','Saturday'],[i for i in range(1,8)])}

In [23]:
rank

{'Sunday': 1,
 'Monday': 2,
 'Tuesday': 3,
 'Wednesday': 4,
 'Thursday': 5,
 'Friday': 6,
 'Saturday': 7}

In [24]:
data['weekday_rank']=data['weekday'].map(rank)

In [25]:
data.head()

                         Day   weekday  weekday_rank
0 2023-05-22 10:48:10.544745    Monday             2
1 2023-05-21 10:48:10.544745    Sunday             1
2 2023-05-20 10:48:10.544745  Saturday             7
3 2023-05-19 10:48:10.544745    Friday             6
4 2023-05-18 10:48:10.544745  Thursday             5

#### Count or Frequency Encoding

In [26]:
data1=pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None,usecols=[1,3,5,6,7,8,9,13])

In [27]:
data1.head()

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [28]:
data1.columns=['Employment','Degree','Marraige_Status','Designation','Family','Race','Sex','Country']

In [29]:
data1.head()

,Employment,Degree,Marraige_Status,Designation,Family,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [30]:
for i in data1.columns:
    print(i,":",len(data1[i].unique()))

Employment : 9
Degree : 16
Marraige_Status : 7
Designation : 15
Family : 6
Race : 5
Sex : 2
Country : 42

In [31]:
data1.head()

,Employment,Degree,Marraige_Status,Designation,Family,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [32]:
country_map=data1['Country'].value_counts().to_dict()

In [33]:
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Laos': 18,
 ' Thailand': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [34]:
data1['Country']=data1['Country'].map(country_map)

In [35]:
data1.head()

,Employment,Degree,Marraige_Status,Designation,Family,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Target Guided ordinal encoding

In [36]:
df1=pd.read_csv('titanic_train.csv',usecols=['Cabin','Survived'])

In [37]:
df1.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [38]:
df1['Cabin'].fillna('missing',inplace=True)

In [54]:
df1['Cabin']=[x[0] for x in df1['Cabin']]

In [55]:
df1

     Survived Cabin
0           0     m
1           1     C
2           1     m
3           1     C
4           0     m
..        ...   ...
886         0     m
887         1     B
888         0     m
889         1     C
890         0     m

[891 rows x 2 columns]

In [63]:
ordinal_labels=df1.groupby('Cabin')['Survived'].mean().sort_values().index

In [64]:
ordinal_labels

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [65]:
ordinal_labels_dic={k:i for i,k in enumerate(ordinal_labels,0)}

In [66]:
ordinal_labels_dic

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [67]:
df1['Cabin_ord']=df1['Cabin'].map(ordinal_labels_dic)

In [68]:
df1.head()

   Survived Cabin  Cabin_ord
0         0     m          1
1         1     C          4
2         1     m          1
3         1     C          4
4         0     m          1

#### Mean Encoding

In [71]:
mean_ord=df1.groupby('Cabin')['Survived'].mean().sort_values().to_dict()

In [72]:
df1['Mean_ordinal']=df1['Cabin'].map(mean_ord)

In [73]:
df1.head()

   Survived Cabin  Cabin_ord  Mean_ordinal
0         0     m          1      0.299854
1         1     C          4      0.593220
2         1     m          1      0.299854
3         1     C          4      0.593220
4         0     m          1      0.299854